app/controllers/chat_controller.rb

SELECT * FROM "crews" WHERE ("crews"."status" = 1)
SELECT * FROM "versions" WHERE ("versions"."status" IN ('active','checked'))
---
  def index
    @messages = Message.find(:all, :limit => 50, :order => 'created_at DESC')
    @message = Message.new
    @crews = Crew.find(:all, :conditions => {:status => 1})

    @versions = Version.find(:all, :conditions => {:status => ['active', 'checked']})