app/controllers/connections_controller.rb

  def create
    @player = Player.find(params[:client_id])
    @player.update_attribute :status, 1
    unless @player.staff
      @player.crew.players.active.count > 0 ? nil : @player.crew.update_attribute(:status, 1)
---
SELECT * FROM "players" WHERE ("players"."id" = 1)
UPDATE "players" SET "updated_at" = '2009-04-02 23:37:46', "status" = 1 WHERE "id" = 1
SELECT * FROM "crews" WHERE ("crews"."id" = 1)
SELECT count(*) AS count_all FROM "players" WHERE ((("players"."status" = 1) AND ("players".crew_id = 2)) AND ("players".crew_id = 2))

  def destroy
    @player = Player.find(params[:client_id])
    @player.update_attribute :status, 0
    unless @player.staff
      @player.crew.players.active.count > 0 ? nil : @player.crew.update_attribute(:status, 0)
---
SELECT * FROM "players" WHERE ("players"."id" = 1)
UPDATE "players" SET "updated_at" = '2009-04-02 23:49:12', "status" = 0 WHERE "id" = 1
SELECT * FROM "crews" WHERE ("crews"."id" = 1)
SELECT count(*) AS count_all FROM "players" WHERE ((("players"."status" = 1) AND ("players".crew_id = 2)) AND ("players".crew_id = 2))
UPDATE "crews" SET "updated_at" = '2009-04-04 05:30:36', "status" = 0 WHERE "id" = 2