app/controllers/crews_controller.rb

SELECT * FROM "crews" WHERE ("crews"."id" = 1)
UPDATE "crews" SET "updated_at" = '2009-04-03 03:34:32', "location" = 'жопа' WHERE "id" = 1
INSERT INTO "messages" ("vis", "created_at", "updated_at", "text", "player_id", "crew_id") VALUES('update', '2009-04-03 03:34:32', '2009-04-03 03:34:32', 'поменяли локацию на "Calda"', 1, 1)
---
  def update_location
    @crew = Crew.find(params[:id])
    @crew.update_attribute :location, params[:location]
    @message = Message.create :text => "поменяли локацию на \"#{@crew.location}\"", :vis => 'update', :player_id => @current_player.id, :crew_id => @current_player.crew_id