app/controllers/messages_controller.rb

INSERT INTO "messages" ("created_at", "updated_at", "text", "player_id", "crew_id", "type") VALUES('2009-04-02 23:48:41', '2009-04-02 23:48:41', 'hello!', 1, 1, NULL)
---
  def create
    @message = Message.new(params[:message])
    @message.player_id = @current_player.id
    @message.crew_id = @current_player.crew_id
    @message.save