app/controllers/players_controller.rb

  def create
    if params[:crew] && params[:crew][:title] != ''
      @crew = Crew.create(params[:crew])
      params[:player][:crew_id] = @crew.id
    end
    @player = Player.new(params[:player])
    @player.status = 1
    @player.save
---
INSERT INTO "crews" ("location", "created_at", "title", "updated_at", "version_id", "status") VALUES(NULL, '2009-04-02 23:48:36', 'Calda', '2009-04-02 23:48:36', NULL, 1)
INSERT INTO "players" ("name", "created_at", "updated_at", "staff", "crew_id", "status") VALUES('Andrew', '2009-04-02 23:31:19', '2009-04-02 23:31:19', 'f', 1, NULL)

  def destroy
    @player = Player.find(params[:id])
    @player.update_attribute(:status, 0)

    session[:player_id] = nil
    session[:passed] = nil
    unless @player.staff
      @player.crew.players.active.count > 0 ? nil : @player.crew.update_attribute(:status, 0)
---
SELECT * FROM "players" WHERE ("players".crew_id = 1)
UPDATE "players" SET "updated_at" = '2009-04-03 04:40:55', "status" = 0 WHERE "id" = 1
SELECT * FROM "crews" WHERE ("crews"."id" = 1)
SELECT count(*) AS count_all FROM "players" WHERE ((("players"."status" = 1) AND ("players".crew_id = 1)) AND ("players".crew_id = 1))
UPDATE "crews" SET "updated_at" = '2009-04-04 05:31:45', "status" = 0 WHERE "id" = 1