app/controllers/versions_controller.rb

INSERT INTO "versions" ("created_at", "title", "updated_at", "desc", "status") VALUES('2009-04-03 02:46:41', 'бла', '2009-04-03 02:46:41', 'блабла', NULL)
INSERT INTO "messages" ("vis", "created_at", "updated_at", "text", "player_id", "crew_id") VALUES('update', '2009-04-03 02:47:20', '2009-04-03 02:47:20', 'добавлена версия "бла"', 1, 1)
---
  def create
    @version = Version.create(params[:version])
    @message = Message.create :text => "добавлена версия \"#{@version.title}\"",
                              :vis => 'update',
                              :player_id => @current_player.id,
                              :crew_id => @current_player.crew_id

DELETE FROM "versions" WHERE "id" = 1
SELECT * FROM "versions" WHERE ("versions"."id" = 1)
INSERT INTO "messages" ("vis", "created_at", "updated_at", "text", "player_id", "crew_id") VALUES('update', '2009-04-03 03:11:23', '2009-04-03 03:11:23', 'удалена версия "бла"', 1, 1)
---
  def destroy
    @version = Version.find(params[:id]).destroy
    @message = Message.create :text => "удалена версия \"#{@version.title}\"", :vis => 'update', :player_id => @current_player.id, :crew_id => @current_player.crew_id

SELECT * FROM "versions" WHERE ("versions"."id" = 1)
UPDATE "versions" SET "updated_at" = '2009-04-03 02:59:44', "status" = 'checked' WHERE "id" = 1
INSERT INTO "messages" ("vis", "created_at", "updated_at", "text", "player_id", "crew_id") VALUES('update', '2009-04-03 03:00:53', '2009-04-03 03:00:53', 'проверена версия "бла"', 1, 1)
---
  def check
    @version = Version.find(params[:id])
    @version.update_attribute :status, 'checked'
    @message = Message.create :text => "проверена версия \"#{@version.title}\"", :vis => 'update', :player_id => @current_player.id, :crew_id => @current_player.crew_id

SELECT * FROM "versions" WHERE ("versions"."id" = 1)
---
  def suggest
    @version = Version.find(params[:version_id])

SELECT * FROM "versions" WHERE ("versions"."id" = 1)
UPDATE "crews" SET "updated_at" = '2009-04-03 05:25:31', "version_id" = 1 WHERE "id" = 1
INSERT INTO "messages" ("vis", "created_at", "updated_at", "text", "player_id", "crew_id") VALUES('update', '2009-04-03 05:25:31', '2009-04-03 05:25:31', 'отправились на версию "23 школа"', 2, 1)
---
  def agree
    @version = Version.find(params[:id])
    @current_player.crew.version = @version
    @current_player.crew.location = @version.title
    @current_player.crew.save
    @message = Message.create :text => "отправились на версию \"#{@version.title}\"", :vis => 'update', :player_id => @current_player.id, :crew_id => @current_player.crew_id

SELECT * FROM "versions" WHERE ("versions"."id" = 2)
UPDATE "crews" SET "updated_at" = '2009-04-03 06:58:12', "location" = '23 школа', "version_id" = 1 WHERE "id" = 1
INSERT INTO "messages" ("vis", "created_at", "updated_at", "text", "player_id", "crew_id") VALUES('update', '2009-04-03 06:57:07', '2009-04-03 06:57:07', 'отправились на версию "90 школа"', 1, 1)
---
  def go
    @version = Version.find(params[:id])
    @current_player.crew.version = @version
    @current_player.crew.location = @version.title
    @current_player.crew.save
    @message = Message.create :text => "отправились на версию \"#{@version.title}\"", :vis => 'update', :player_id => @current_player.id, :crew_id => @current_player.crew_id